## Staging: iam
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                    NAME                                     |
|--------|-----------------------------------------------------------------------------|
| delete | `aws_iam_policy.s3_readonly_policy`                                         |
|        | `aws_iam_role_policy_attachment.s3_readonly_policy_attachment`              |
|        | `module.github_oidc_role.aws_iam_role.this[&quot;GHOIDCCodespacesReadOnlyRole&quot;]` |
| add    | `aws_iam_policy.s3_web_readwrite_policy`                                    |
|        | `aws_iam_role_policy_attachment.s3_readwrite_policy_attachment`             |
|        | `module.github_oidc_role.aws_iam_role.this[&quot;S3WebReadWriteRole&quot;]`           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_policy.s3_readonly_policy will be destroyed
  # (because aws_iam_policy.s3_readonly_policy is not in configuration)
  - resource "aws_iam_policy" "s3_readonly_policy" {
      - arn              = "arn:aws:iam::211125499457:policy/github-codespaces-s3-readonly-policy" -> null
      - attachment_count = 0 -> null
      - description      = "Policy allowing GitHub Codespaces read-only access to the specific S3 bucket" -> null
      - id               = "arn:aws:iam::211125499457:policy/github-codespaces-s3-readonly-policy" -> null
      - name             = "github-codespaces-s3-readonly-policy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:ListBucket",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::cra-arc-upd-tbpc-codespaces-data",
                          - "arn:aws:s3:::cra-arc-upd-tbpc-codespaces-data/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPATCKAPOZA2CZIT6WSA" -> null
      - tags             = {
          - "Environment" = "staging"
          - "ManagedBy"   = "Terraform"
          - "Project"     = "cra-arc-upd-tbpc"
          - "Purpose"     = "Codespaces Data"
        } -> null
      - tags_all         = {
          - "Environment" = "staging"
          - "ManagedBy"   = "Terraform"
          - "Project"     = "cra-arc-upd-tbpc"
          - "Purpose"     = "Codespaces Data"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_policy.s3_web_readwrite_policy will be created
  + resource "aws_iam_policy" "s3_web_readwrite_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy giving read-write access to the web resources S3 bucket"
      + id               = (known after apply)
      + name             = "s3-web-readwrite-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "/*",
                          + "",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
    }

  # aws_iam_role_policy_attachment.s3_readonly_policy_attachment will be destroyed
  # (because aws_iam_role_policy_attachment.s3_readonly_policy_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "s3_readonly_policy_attachment" {
      - id         = "GHOIDCCodespacesReadOnlyRole-20250428201435725800000001" -> null
      - policy_arn = "arn:aws:iam::211125499457:policy/github-codespaces-s3-readonly-policy" -> null
      - role       = "GHOIDCCodespacesReadOnlyRole" -> null
    }

  # aws_iam_role_policy_attachment.s3_readwrite_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "s3_readwrite_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "S3WebReadWriteRole"
    }

  # module.github_oidc_role.aws_iam_role.this["GHOIDCCodespacesReadOnlyRole"] will be destroyed
  # (because key ["GHOIDCCodespacesReadOnlyRole"] is not in for_each map)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::211125499457:role/GHOIDCCodespacesReadOnlyRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - "token.actions.githubusercontent.com:sub" = "repo:cds-snc/cra-arc-upd-tbpc:ref:refs/heads/main"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::211125499457:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-04-28T20:14:35Z" -> null
      - force_detach_policies = false -> null
      - id                    = "GHOIDCCodespacesReadOnlyRole" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "GHOIDCCodespacesReadOnlyRole" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "CostCentre" = "cra-arc-upd-tbpc"
          - "Terraform"  = "true"
        } -> null
      - tags_all              = {
          - "CostCentre" = "cra-arc-upd-tbpc"
          - "Terraform"  = "true"
        } -> null
      - unique_id             = "AROATCKAPOZA26IVQX3KZ" -> null
        # (3 unchanged attributes hidden)
    }

  # module.github_oidc_role.aws_iam_role.this["S3WebReadWriteRole"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/cra-arc-upd-tbpc:ref:refs/heads/main"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::211125499457:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "S3WebReadWriteRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  - github_oidc_codespaces_readonly_role_arn = "arn:aws:iam::211125499457:role/GHOIDCCodespacesReadOnlyRole" -> null
  + github_oidc_web_readwrite_role_arn       = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.s3_web_readwrite_policy"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
